Repository: xulihang/BasicCAT_docs_en_translation
Catalog: tm_2018_12_16.tmx
Source language: zh
Languages: en

source: 我们要关注的主要是designmap.xml文件、Spreads文件夹、Stories文件夹和Resources文件夹的内容。
en: What relevant to us are designmap.xml, spreads folder, stories folder and resources folder.

source: 所以平时添加术语最好还是添加原形，方便导入其它项目。
en: So when adding a term, it is better to add in its original form.

source: 所以，为了保证英译汉时，标签的效果在生成的译文中也有效，BasicCAT采用具有7种字重的思源宋体作为中文的显示字体，并将英文的字重转换为对应的思源宋体的字重。
en: So, to assure that the tags will make effects for English to Chinese translation projects, BasicCAT uses Source Han Serif as IDML's Chinese font. Source Han Serif has 7 font weights.

source: 所以，为了在生成的idml文件中显示中文，需要安装思源宋体。
en: So, you need to install Source Han Serif to display Chinese in InDesign.

source: 打开Rainbow，把要翻译的源文件拖拽进去。
en: Open Rainbow and drag source files into the window.

source: 打开项目后在左侧会显示一列项目，可以操作项目文件、翻译记忆、术语库，查看统计信息和预览。
en: When a project is opened, a list of item will show in the left area. You can manage project files, translation memory, term base, view statistics and preview.

source: 抽象占位符标签的好处是针对不同格式，抽象出来的内容可以一样。
en: The placeholder way abstracts tags to its preset placeholder tags.

source: 按Open in browser可以使用本地浏览器访问该页面。
en: Press "Open in browser" to open the page in local browsers.

source: 搜索与替换
en: Search and Replace

source: 支持使用正则表达式。
en: Regular expressions are supported.

source: 支持利用翻译记忆与机器翻译进行全文预翻译
en: Pretranslate based on translation memory and machine translation

source: 支持导入TMX格式和Tab分割的txt文件，txt文件要求原文在前，译文在后，以tab进行分割。
en: You can import TMX files or tab-delimited txt files. For txt files, the source should be in the first row and the target should be in the second.

source: 支持常见源文件格式：txt, idml, xliff, gettext po
en: Support common file formats: TXT, idml, xliff, gettext Po

source: 支持翻译记忆标准TMX、术语管理标准TBX和句段分割标准SRX
en: Support three translation standards: TMX, TBX and SRX

source: 新建项目
en: New Project

source: 新建项目后要进一步操作需要先保存项目。
en: Save the project before further operations.

source: 更多内容可以见GitHub的\\ `帮助文档 <https://help.github.com/>`_\\ 。
en: See the `GitHub Help <https://help.github.com/>`_ to learn more.

source: 更多功能可以通过安装Git桌面客户端来实现。
en: More functions can be realized by installing a git desktop client.

source: 最新版的InDesign生成的文件要想给老版本的InDesign打开，往往便要使用IDML格式。
en: Documents made by the latest version of InDesign have to be converted to IDML for use in old versions of InDesign.

source: 最终，上述内容在BasicCAT中是这样显示的：
en: When the example story is opened by BasicCAT, the result looks like this:

source: 有用于检查译文质量的checkmate、修改句段分割规则的Ratel，还有用于执行各种翻译与本地化任务的Rainbow。
en: It has Checkmate to check translation quality, Ratel to edit segmentation rule and Rainbow to do all kinds of translation and localization tasks.

source: 服务器程序运行的方法（需要安装java8以上版本）：
en: How to run the server program (requires java8+):

source: 术语的导入和翻译记忆的导入类似，支持的文件类型是TBX和Tab分割的TXT文件。
en: Importing terms is much the same as importing translation memory. TBX and tab-delimited txt files are supported.

source: 术语的管理界面也和翻译记忆的类似，不同之处在于术语可以添加标签和备注进行管理。
en: Term manager is also similar to TM manager. The difference lies in that tags and notes can be added for terms.

source: 术语管理
en: Terminology Management

source: 机器翻译
en: Machine Translation

source: 机器翻译的API服务都有使用限制，百度和微软每个月200万词免费额度；
en: These translation services have usage limits. Baidu and Bing have a 2million limit per month;

source: 查看片段历史
en: View segment history

source: 查看项目统计信息
en: Statistics

source: 查看预览
en: Preview

source: 标签内容如果不翻，生成的译文中会自动在结尾处补上缺失的标签，但有可能导致译文内容缺损。
en: If tags are not put in the target text, BasicCAT will fill them at the end of target text. But this may result in incomplete content.

source: 模糊匹配到外部记忆库的片段时，会在下方显示，并显示来自哪个记忆库文件。
en: When a segment from external translation memory is matched, a filename will show to indicate where that match comes from.

source: 此时可以选择继续进行合并，但可能会显示出较为复杂的标签。
en: You can choose to continue, and the merged source text may contains complex tags.

source: 段落信息保存在ParagraphStyleRange这个标签里，一个ParagraphStyleRange标签可以包含很多CharacterStyleRange标签，里面是具体的文本。
en: Paragraph info is stored in the ParagraphStyleRange tag. One ParagraphStyleRange tag can include many CharacterStyleRange tags which include texts.

source: 每个功能分区都已在图中标出。
en: Every function area is marked out in the picture.

source: 每次请求git push时，程序会自动从远程仓库获取最新的变动，并更新本地文件，然后将本地的修改进行上传。
en: When requesting a git push, the program will fetch the latest changes and update local files. Then new changes in the local repo will be uploaded.

source: 比如html、rtf中表示加粗，html是 ``<b>`` ，而rtf中是 ``\\b`` ，抽象之后都变成了g标签，而且显示的内容更少。
en: To indicate bold, HTML uses ``<b>`` and RTF uses ``\\b``. They all become ``<g>`` in XLIFF. It also shows less tags info.

source: 比如rst是restructuredText的缩写，设置自动更正后，每次输入rst，内容就会自动变成restructuredText。
en: For example, "rst" is the abbreviation of "restructuredText". When AutoCorrect is setuped, we can input "rst" the get "restructuredText".

source: 比如对于This is **bold**，在xliff中有两种表示方法。
en: For example, there are two ways to represent "This is **bold**." in XLIFF.

source: 比如英译汉时需要输入中文的标点符号，可以设置错误地输入英文标点符号时自动更正为中文标点。
en: For example, we need to input Chinese punctuations when doing an English to Chinese translation and autocorrect can replace English punctuations to Chinese punctuations.

source: 添加备注
en: Add notes

source: 添加外部翻译记忆
en: Add External Translation Memory

source: 添加文件
en: Add File

source: 添加文件后点击文件名，可以打开该文件进行翻译，并进入下图的界面。
en: Click filenames to open files. The interface will look like this when a file is opened.

source: 添加文件时会显示一个预览窗口，便于检验导入的内容是否正确。
en: A preview window will appear when you add a new file.

source: 点击出现的下拉框中的项目可以把结果添加到译文输入框。
en: You can fill the result to the translation textarea by clicking the item in the dropdown list.

source: 点击功能区的replacement项目或者下拉列表的项目可以替换译文中的错误为正确的内容。
en: By clicking the replacement item in the lower area or the dropdown list item, the mistakes will be replaced to the right one.

source: 点击后会打开一个浏览窗口。
en: A browse window will be opened.

source: 点击执行后，在目标位置会生成一个pack1文件夹，里面的work文件夹存放了生成的xliff等格式文件。
en: After the execution is done, there will be a folder named pack1 in the output path. In the work folder are generated files.

source: 点击菜单Edit->Search and Replace进入搜索与替换对话框，可以检索原文和译文的内容。
en: Click menu "Edit->Search and Replace" to open the Search and Replace Dialog. You can search in the source or the target text.

source: 点击菜单Options->Preferences进入设置界面，选择Machine Translation进行翻译API的配置。
en: Use Menu "Options->Preferences" to enter the setup interface.

source: 点击菜单Options->Preferences进入设置窗口，点击左边的Appearence，可以进行外观方面的设置。
en: Click menu "Options->Preferences" to enter the Preferences Window. Click "Appearance" in the left.

source: 点击菜单Project->Pre-translate打开对话框，选择使用翻译记忆或者机器翻译进行预翻译。
en: Use Menu "Project->Pre-translate" to open the dialog and choose TM or MT to do this.

source: 点击菜单Project->Project Settings，切换到AutoCorrect栏目进行设置。
en: Click menu "Project->Project Settings" to set up AutoCorrect.

source: 点击菜单Utilities->Translation Kit Creation，选择要生成xliff、po还是其它中间格式，选择生成的目标位置（默认为源文件所在目录）。
en: Click menu "Utilities->Translation Kit Creation". You can choose to generate XLIFF, PO or other intermediate formats. The default output path is the source files' folder.

source: 点击菜单Utilities->Translation Kit Post-processing，可以生成目标文件。
en: Click menu "Utilities->Translation Kit Post-processing" to generate target files.

source: 点击菜单栏Edit->Show/Edit notes of the current segment进行查看或修改操作。
en: Use Menu Edit->Show/Edit notes of the current segment to view or edit notes.

source: 点击菜单栏Project->Project Settings，选中TM一栏设置可以进行外部翻译记忆的管理。
en: Click "Project->Project Settings", and in the "TM" page, you can manage external translation memory.

source: 点击该条结果即可将译文填充进译文输入框。
en: Click that match to fill the translation into the textarea.

source: 点击项目区的Preview，可以对翻译的内容进行预览。
en: Click "Preview" in the project area to preview the text.

source: 点击项目区的Statistics，可以显示项目的统计信息，比如原文字数、译文字数和完成的百分比等。
en: Click "Statistics" in the project area, you can see the statistics like words number and percentage completed.

source: 点击项目区的Translation Memory可以对翻译记忆进行检索，并进行导出、修改和删除等操作。
en: Click "Translation Memory" in the Project area to open TM Manager. You can search, export, edit or remove translation memories.

source: 然后添加manifest.rkm到Rainbow中。
en: Open Rainbow and drag manifest.rkm into it.

source: 然后点击Start LanguageTool Server的按钮后可以在本地运行LanguageTool的离线服务。
en: Press "Start LanguageTool Server" to run the server locally.

source: 片段合并与分割
en: Merge and Split Segments

source: 片段多为一个句子或者一个单独成段的短语。
en: A segment can be a sentence or a phrase.

source: 片段操作
en: Segments Manipulation

source: 片段翻译完成后按回车，该条翻译的内容就会自动加入翻译记忆库。
en: After you press "Enter" to finish one segment, the translation will be added to the translation memory.

source: 生成目标文件
en: Generate target files

source: 用Adobe Acrobat可以修改文字，但有诸多限制。
en: Adobe Acrobat can be used to modify text, but there are many limitations.

source: 百度网盘（备用）：https://pan.baidu.com/s/1LNW4IDw8Viz6RURmzqxI9Q
en: BaiduNetdisk (backup download): https://pan.baidu.com/s/1LNW4IDw8Viz6RURmzqxI9Q

source: 目前仅支持设置编辑区的字体。
en: For now, only setting of editing area's font is supported.

source: 目录
en: Contents

source: 简介
en: Introduction

source: 管理插件
en: Managing Plugins

source: 管理翻译记忆
en: Manage Translation Memory

source: 纯文本文件
en: TXT Files

source: 翻译中碰到较难的句子，可以进行备注，记录为什么这样翻。
en: If you come across difficult sentences, you can make notes on how you get the translation done.

source: 翻译各种格式的文件
en: Translating All Kinds of Files

source: 翻译完成后，把xliff等格式文件放回work文件夹。
en: When the translation is done, put the translated files back into the work folder.

source: 翻译结束后，点击菜单File->Generate target files，即可在项目的target文件夹里生成目标文件。
en: When translation is done, use menu "File->Generate target files" to create translated files in the target folder.

source: 翻译记忆
en: Translation Memory

source: 翻译记忆中的原文、当前要翻译的原文和翻译记忆中的译文会在差异显示区显示。
en: The source text in the translation memory, the source text of the current segment and the target text in the translation memory will show in the differences display area.

source: 翻译记忆的匹配率可以点击菜单栏Project->Project Settings进行设置。
en: Translation memory's match rate can be set in Project Settings.

source: 翻译过程中我们常常需要输入特殊的符号，或者需要多次输入同一串文本。
en: We often have to input special characters or the same text many times.

source: 考虑到导入的外部术语库可能有上万条内容，为了优化匹配的速度，采用的HashMap的算法，只能对要翻译的原文进行词型还原。
en: As an external term database may contains thousands of entries, BasicCAT uses a HashMap algorithm to match terms. Only the text in the source will be lemmatized. Terms in external termbases will not be lemmatized.

source: 而 ``<c0 id=\"3\">`` 中的id属性则是story中characterstylerange的顺序，用于生成目标文件时读取本地样式。
en: The id attribute of ``<c0 id=\"3\">`` corresponds to the rank of characterstylerange in a story file. The number is used to read local styles when generating target files.

source: 自动备份
en: Auto Backup

source: 自动完成对原文进行分词，并利用斯坦福自然语言处理工具进行句法分析，提取短语，所得的片段利用机器翻译进行翻译，如果在翻译过程中输入的字是某个片段的开头，那这一片段的译文会以下拉列表的形式供用户选择是否使用。
en: Here is how autocomplete works: The source text is tokenized and parsed using Stanford NLP Tools. Then, words and phrases will be extracted and get machine translated. The results will be stored in the memory. When the user inputs a word that match the beginning of these segments, a dropdown list containing matched translation suggestions will show.

source: 自动完成（交互式机器翻译）
en: Autocomplete (Interactive Machine Translation)

source: 自动更正
en: AutoCorrect

source: 自动更正是借鉴自Word的一项功能，可以检测输入的内容，对内容进行修正。
en: AutoCorrect is inspired by Microsoft Word's function. It can detect the inputed text and correct spelling errors.

source: 英文字体一般有很多字重，比如特细、细、常规、粗等，而中文字体一般只有一种常规体。
en: English fonts often have many font weights, like Extra Light, Light, Normal and Heavy, while Chinese fonts often have only one regular font weight.

source: 英译汉时常碰到前一片段和后一片段意思有重复，只需翻译后一片段的情况。
en: When doing English to Chinese translation, it is common that the first segment and the second one have similar meanings.

source: 菜单栏点击File->New，选择建立英译汉(en to zh)、汉译英(zh to en)项目或者其它语言对的项目，会自动生成翻译记忆库和术语库等项目文件。
en: Click "File"->"New", choose "en to zh" to create English to Chinese projects and "zh to en" to create Chinese to English projects. Choose other language pair to specify the source language and target language of the project. Translation Memory and Term Base will be created at the same time.

source: 要使用自动完成，需要下载斯坦福自然语言处理软件。
en: To use autocomplete, Stanford CoreNLP is needed.

source: 要使用语言检查，你需要先下载LanguageTool。
en: To use language check, you need to download languagetool first.

source: 要翻译其它格式文件，我们主要需要使用Rainbow。
en: To translate files in other formats, we need to use Rainbow.

source: 设置不可译片段
en: Mark non-translatable segments

source: 设置不可译的片段的编辑区会变成灰色不可用状态。
en: Textarea for non-translatable segments will be gray and not editable.

source: 该程序可以在BasicCAT的下载页面获取。
en: The program is available in the BasicCAT's download page.

source: 语言检查
en: Language Check

source: 调用多种在线词典
en: Online Dictionaries Integration

source: 调用结果如下图。
en: The result will show in the lower area.

source: 软件具有以下功能：
en: It has the following features:

source: 这时可以设置前一片段为不可译片段。
en: You can mark the first one as non-translatable and only translate the second one.

source: 这时，我们需要做的就是提取PDF的文字进行翻译。
en: In such a case, what translators have to do is to extract the text from PDF.

source: 这样，生成译文时会自动忽略这一片段。
en: When generating target files, non-translatable segments will be omitted.

source: 进入GitHub的仓库设置，点击左边的Collaborators然后添加要添加的GitHub账户。
en: In the settings of the repository, click Collaborators on the left and add other translators' GitHub account.

source: 进入以下设置界面：
en: Will see this setting page:

source: 进入设置界面可以选择插件存放的文件夹，执行插件的增删操作。
en: You can set the plugin folder and add or remove plugins in the Preferences.

source: 进行原文和译文、文件编码等设置。
en: Set the source language, target languages, file encoding, etc.

source: 进阶操作
en: Advanced Features

source: 选中想输入的释义后，按Add Selected可以填充进译文输入框。
en: Use "Add Selected" Button to fill selected text in the browser to the translation textarea.

source: 选择其它语言对时你也可以自己输入所需的遵循ISO639标准的语言代码，具体说明\\ `见此 <http://www.basiccat.org/1-2-beta-has-multilanguage-support/>`_\\ 。
en: You can also enter the required language code that complies with the ISO 639 standard by yourself. See the detailed info `here <http://www.basiccat.org/1-2-beta-has-multilanguage-support/>`_.

source: 通过Word的Felix加载项操作界面进入Felix的设置界面，取消勾选Format标签下的勾选框，这样替换纯文本的翻译记忆时，不会修改原文的格式。
en: In Word's add-in tab, you can access Felix's interface. In Felix's settings, uncheck the checkboxes in Format Tab. By doing this, when Felix replaces source text with target text, the original formats will be preserved.

source: 遇到下图这样的人名分割错误的情况，我们可以点击原文的末尾，然后按Delete键进行句段合并操作。
en: If you come across a wrongly segmented name like below, you can move the cursor to the end and press "Delete" to merge the two segments.

source: 遇到下图这样需要在分号处进行分割的片段，将光标定位到分号后，按Enter键进行分割。
en: When you need to split, like at the semicolon below, move the cursor to the semicolon and press "Enter".

source: 除此之外，你还要设置启用语言检查。
en: In addition, you need to check the "enable language tool" checkbox in settings.

source: 需要下载corenlp和中文的模型文件。
en: CoreNLP and the Chinese model jar are needed.

source: 需要在设置中勾选这一功能，并配置至少一个机器翻译。
en: You need to check this function in settings and enable at least one machine translation service.

source: 需要在项目设置里设置远程仓库地址并选择是否每次执行保存操作时把修改上传到远程仓库。
en: You need to set the remote uri in the project settings and choose whether to upload the changes to the remote everytime you perform a save operation.

source: 项目记忆库存储项目文件的翻译记忆，而外部记忆库显示外部导入的翻译记忆。
en: Project memory stores memories created when translating the project's files, while external memory show imported translation memory.

source: 预翻译
en: Pre-translate

source: 预翻译指利用翻译记忆或者机器翻译预先对全文进行翻译。
en: You can use translation memory or machine translation to pre-translate the whole text.

source: 首先建立一个空的仓库：
en: First, create an empty repository.
